cfe llm/Catalogs/AI_МестаЗапускаСценариев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_МестаЗапускаСценариев</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Сценарии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипМеста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеКоманды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment /><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
					<FillFromFillingValue>false</FillFromFillingValue>				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйЗапрос</Name>
					<Comment /><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
					<FillFromFillingValue>false</FillFromFillingValue>				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьНесколькоОбъектов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимДиалога</Name>					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаИзвлечения</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.AI_КартыИзвлечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДействия</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_ВидДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодПодготовкиЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодПослеОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодПослеДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыполнения</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_РежимВыполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Уточнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУточнения</Name>
							<Type>
								<v8:Type>d5p1:EnumRef.AI_ВидУточнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитПредставления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитСодержимого</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитИмениФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтборРеквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтборЗначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПередаватьСодержимое</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборыКонтекста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>d5p1:EnumRef.AI_ВидСравненияОтбора</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыДействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначения</Name>
							<Type>
								<v8:Type>d5p1:EnumRef.AI_ТипЗначенияПоля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСсылки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеОбъекта</Name>				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТабличнаяЧасть</Name>							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьРеквизита</Name>							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Видимость</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидУсловия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/Enums/AI_ВидДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AI_ВидДействия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТолькоПоказать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнитьФорму</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписатьОбъект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПользовательскоеДействие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийОбработчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьОбъект</Name>				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe llm/Catalogs/AI_МестаЗапускаСценариев/Forms/ФормаЭлемента/Ext/Form/Module.bsl
// Место запуска глазами администратора: где действие видно, что оно делает и
// о чем спросит пользователя.
//
// Форма не только редактирует справочник, но и проверяет настройку: опечатка в
// имени объекта, отставшая схема ответа или обработка БСП, не назначенная на
// объект, иначе всплывают только у пользователя — действие просто не видно.

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(Объект.ТипМеста) Тогда
		Объект.ТипМеста = "Объект";
	КонецЕсли;
	// Пояснения в одну узкую колонку читаются плохо: пусть занимают всю ширину.
	Для Каждого ИмяНадписи Из СтрРазделить("ТекстПроверки,ПредставлениеОбъекта,ПояснениеУточнений,ПояснениеВидимости", ",") Цикл
		Элементы[ИмяНадписи].РастягиватьПоГоризонтали = Истина;
		Элементы[ИмяНадписи].АвтоМаксимальнаяШирина = Ложь;
	КонецЦикла;
	// Вид условия видимости — из закрытого списка: опечатка в нем тихо прятала
	// бы действие от всех.
	Для Каждого Вид Из AI_ИнтерфейсныеСценарии.ВидыУсловийВидимости() Цикл
		Элементы.ВидимостьВидУсловия.СписокВыбора.Добавить(Вид.Значение, Вид.Представление);
	КонецЦикла;
	Элементы.ВидимостьВидУсловия.РежимВыбораИзСписка = Истина;
	ОбновитьВидимость();
	ОбновитьПредставлениеОбъекта();
	ЗаполнитьМетодыОбработчика();
	ОбновитьПроверку();

	// Таблица вопросов открывается на первой строке — панель показывает ее.
	Если Объект.Уточнения.Количество() > 0 Тогда
		Для Каждого ИмяКолонки Из КолонкиПанелиВопроса() Цикл
			ЭтотОбъект["Вопрос" + ИмяКолонки] = Объект.Уточнения[0][ИмяКолонки];
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ОбновитьПроверку();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипМестаПриИзменении(Элемент)

	ОбновитьВидимостьНаСервере();

КонецПроцедуры

// Полное имя метаданных набирать руками не нужно: опечатка в нем прячет
// действие молча. Выбор идет из объектов конфигурации с человеческими именами.
&НаКлиенте
Процедура ПолноеИмяМетаданныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Варианты = ВариантыОбъектовНаСервере();
	Текущий = Варианты.НайтиПоЗначению(Объект.ПолноеИмяМетаданных);
	Варианты.ПоказатьВыборЭлемента(
		Новый ОписаниеОповещения("ВыборОбъектаЗавершение", ЭтотОбъект),
		"Выберите объект",
		Текущий);

КонецПроцедуры

&НаКлиенте
Процедура ВыборОбъектаЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт

	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Объект.ПолноеИмяМетаданных = ВыбранныйЭлемент.Значение;
	Модифицированность = Истина;
	ОбновитьПредставлениеОбъектаНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПолноеИмяМетаданныхПриИзменении(Элемент)

	ОбновитьПредставлениеОбъектаНаСервере();

КонецПроцедуры

// Объектов в конфигурации сотни: по мере ввода подбираются подходящие по
// названию, в поле ложится полное имя выбранного.
&НаКлиенте
Процедура ПолноеИмяМетаданныхАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	Если СтрДлина(СокрЛП(Текст)) < 2 Или СтрНайти(Текст, ".") > 0 Тогда
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПодходящиеОбъектыНаСервере(Текст);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодходящиеОбъектыНаСервере(Текст)

	Возврат AI_ИнтерфейсныеСценарии.ВариантыОбъектовМетаданных(Текст);

КонецФункции

&НаКлиенте
Процедура РазрешитьНесколькоОбъектовПриИзменении(Элемент)

	ОбновитьВидимостьНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ВидДействияПриИзменении(Элемент)

	ОбновитьВидимостьНаСервере();

КонецПроцедуры

// Обработчик действия выбирается из реестра дополнительных обработок: имя,
// набранное с опечаткой, всплыло бы только при первом применении.
&НаКлиенте
Процедура ОбработчикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Варианты = ЗарегистрированныеОбработкиНаСервере();
	Если Варианты.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "В реестре дополнительных отчетов и обработок нет обработок,"
			+ " которые можно выбрать. Зарегистрируйте обработку действия и повторите.");
		Возврат;
	КонецЕсли;
	Варианты.ПоказатьВыборЭлемента(
		Новый ОписаниеОповещения("ВыборОбработчикаЗавершение", ЭтотОбъект),
		"Выберите обработку действия",
		Варианты.НайтиПоЗначению(Объект.Обработчик));

КонецПроцедуры

&НаКлиенте
Процедура ВыборОбработчикаЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт

	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Объект.Обработчик = ВыбранныйЭлемент.Значение;
	Модифицированность = Истина;
	ЗаполнитьМетодыОбработчикаНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПриИзменении(Элемент)

	ЗаполнитьМетодыОбработчикаНаСервере();

КонецПроцедуры

// Колонок у вопроса много, в строке таблицы они не помещаются. Поэтому таблица
// показывает главное, а источник вариантов выбранного вопроса правится
// панелью под ней: значения копируются в поля панели и обратно в строку.
&НаКлиенте
Процедура УточненияПриАктивизацииСтроки(Элемент)

	ТекущиеДанные = Элементы.Уточнения.ТекущиеДанные;
	Для Каждого ИмяКолонки Из КолонкиПанелиВопроса() Цикл
		ЭтотОбъект["Вопрос" + ИмяКолонки] = ?(ТекущиеДанные = Неопределено, "",
			ТекущиеДанные[ИмяКолонки]);
	КонецЦикла;
	Элементы.ГруппаИсточник.ТолькоПросмотр = (ТекущиеДанные = Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура ПолеВопросаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Уточнения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// Имя поля панели — «Вопрос» и имя колонки строки.
	ИмяКолонки = Сред(Элемент.Имя, СтрДлина("Вопрос") + 1);
	ТекущиеДанные[ИмяКолонки] = ЭтотОбъект[Элемент.Имя];
	Модифицированность = Истина;

КонецПроцедуры

// Реквизит для данных модели выбирается из реквизитов шапки или колонок
// выбранной табличной части: опечатка в имени иначе всплыла бы только отказом
// при запуске действия.
&НаКлиенте
Процедура ДанныеОбъектаПутьРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ДанныеОбъекта.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Варианты = ВариантыРеквизитовДанных(Объект.ПолноеИмяМетаданных, ТекущиеДанные.ТабличнаяЧасть);
	Если Варианты.Количество() <= 1 Тогда
		ПоказатьПредупреждение(, "Сначала выберите объект, а для строк — табличную часть.");
		Возврат;
	КонецЕсли;
	Варианты.ПоказатьВыборЭлемента(
		Новый ОписаниеОповещения("ВыборРеквизитаДанныхЗавершение", ЭтотОбъект,
			Новый Структура("Строка", Элементы.ДанныеОбъекта.ТекущаяСтрока)),
		"Выберите реквизит",
		Варианты.НайтиПоЗначению(ТекущиеДанные.ПутьРеквизита));

КонецПроцедуры

&НаКлиенте
Процедура ВыборРеквизитаДанныхЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт

	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтрокаДанных = Объект.ДанныеОбъекта.НайтиПоИдентификатору(ДополнительныеПараметры.Строка);
	Если СтрокаДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтрокаДанных.ПутьРеквизита = ВыбранныйЭлемент.Значение;
	Модифицированность = Истина;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ВариантыРеквизитовДанных(ПолноеИмя, ИмяТЧ)

	Варианты = Новый СписокЗначений;
	Варианты.Добавить("*", "Все");
	Состав = AI_ИзвлечениеРеквизитов.ВариантыДанныхОбъекта(ПолноеИмя);
	Если Не ЗначениеЗаполнено(ИмяТЧ) Тогда
		Для Каждого Реквизит Из Состав.Реквизиты Цикл
			Варианты.Добавить(Реквизит.Имя, Реквизит.Представление);
		КонецЦикла;
		Возврат Варианты;
	КонецЕсли;
	Для Каждого Часть Из Состав.ТабличныеЧасти Цикл
		Если Часть.Имя = ИмяТЧ Тогда
			Для Каждого Колонка Из Часть.Колонки Цикл
				Варианты.Добавить(Колонка.Имя, Колонка.Представление);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Возврат Варианты;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КолонкиПанелиВопроса()

	Возврат СтрРазделить("Подсказка,ИсточникДанных,РеквизитСвязи,РеквизитПредставления,"
		+ "РеквизитСодержимого,РеквизитИмениФайла,ОтборРеквизит,ОтборЗначение,Идентификатор", ",");

КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьНастройкуОбработка(Команда)

	ОбновитьПроверкуНаСервере();

КонецПроцедуры

// Добавляет объект в назначение обработки помощника в реестре БСП — иначе
// команда помощника в карточке этого объекта не появится.
&НаКлиенте
Процедура ПодключитьКомандуКОбъектуОбработка(Команда)

	Если Не ЗначениеЗаполнено(Объект.ПолноеИмяМетаданных) Тогда
		ПоказатьПредупреждение(, "Сначала выберите объект.");
		Возврат;
	КонецЕсли;
	Ошибка = ПодключитьКомандуНаСервере();
	Если ЗначениеЗаполнено(Ошибка) Тогда
		ПоказатьПредупреждение(, Ошибка);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСхемуСценарияОбработка(Команда)

	Ошибка = ОбновитьСхемуНаСервере();
	Если ЗначениеЗаполнено(Ошибка) Тогда
		ПоказатьПредупреждение(, Ошибка);
	КонецЕсли;

КонецПроцедуры

// Вопрос «какой файл отдать модели» с путями к хранилищу, которые подсистема
// узнает по метаданным конфигурации сама.
&НаКлиенте
Процедура ДобавитьВыборФайлаОбработка(Команда)

	Ошибка = ДобавитьВыборФайлаНаСервере();
	Если ЗначениеЗаполнено(Ошибка) Тогда
		ПоказатьПредупреждение(, Ошибка);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьВидимостьНаСервере()

	ОбновитьВидимость();
	ОбновитьПредставлениеОбъекта();

КонецПроцедуры

// Показываются только поля, которые что-то значат при выбранных настройках:
// имя объекта у действия без объекта, метод действия у записи в объект и
// режим пачки у одиночного действия только путают.
&НаСервере
Процедура ОбновитьВидимость()

	Виды = Перечисления.AI_ВидДействия;
	СОбъектом = (Объект.ТипМеста <> "Глобально");
	Элементы.ПолноеИмяМетаданных.Видимость = СОбъектом;
	Элементы.ПредставлениеОбъекта.Видимость = СОбъектом;
	Элементы.РазрешитьНесколькоОбъектов.Видимость = СОбъектом;
	Элементы.РежимВыполнения.Видимость = СОбъектом И Объект.РазрешитьНесколькоОбъектов;
	// Без объекта передавать модели нечего.
	Элементы.СтраницаДанные.Видимость = СОбъектом;

	ВнешнийОбработчик = (Объект.ВидДействия = Виды.ВнешнийОбработчик);
	Прикладное = (Объект.ВидДействия = Виды.ПользовательскоеДействие);
	// Обработка вмешивается в этапы при любом виде действия: подает файл перед
	// запросом, правит ответ, отчитывается после записи. Само действие она
	// выполняет только у вида «Внешний обработчик», а методы этапов нужны,
	// когда обработка указана.
	ЕстьОбработка = ЗначениеЗаполнено(Объект.Обработчик);
	Элементы.МетодДействия.Видимость = ВнешнийОбработчик;
	Для Каждого ИмяПоля Из СтрРазделить("МетодПроверки,МетодПодготовкиЗапроса,МетодПослеОтвета,МетодПослеДействия", ",") Цикл
		Элементы[ИмяПоля].Видимость = ВнешнийОбработчик Или ЕстьОбработка;
	КонецЦикла;
	Элементы.КлючДействия.Видимость = ВнешнийОбработчик Или Прикладное;
	// Параметры читает и обработка этапов, а не только действие.
	Элементы.СтраницаПараметры.Видимость = ВнешнийОбработчик Или Прикладное Или ЕстьОбработка;
	Элементы.ЗаголовокДействия.Видимость = ЗначениеЗаполнено(Объект.ВидДействия)
		И Объект.ВидДействия <> Виды.ТолькоПоказать;

КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставлениеОбъектаНаСервере()

	ОбновитьПредставлениеОбъекта();

КонецПроцедуры

// Рядом с полным именем — что оно значит: объект конфигурации, «любой объект»
// или имя, которого в конфигурации нет.
&НаСервере
Процедура ОбновитьПредставлениеОбъекта()

	Имя = СокрЛП(Объект.ПолноеИмяМетаданных);
	Если Не ЗначениеЗаполнено(Имя) Или Имя = "*" Тогда
		Текст = "Действие появится в карточке любого объекта конфигурации.";
	ИначеЕсли Метаданные.НайтиПоПолномуИмени(Имя) = Неопределено Тогда
		Текст = "Такого объекта в конфигурации нет — выберите его из списка.";
	Иначе
		Текст = AI_ИнтерфейсныеСценарии.ПредставлениеОбъектаМетаданных(Имя);
	КонецЕсли;
	Элементы.ПредставлениеОбъекта.Заголовок = Текст;

	// Табличные части объекта — в выпадающий список колонки данных модели.
	СписокЧастей = Элементы.ДанныеОбъектаТабличнаяЧасть.СписокВыбора;
	СписокЧастей.Очистить();
	СписокЧастей.Добавить("", "(реквизиты шапки)");
	Для Каждого Часть Из AI_ИзвлечениеРеквизитов.ВариантыДанныхОбъекта(Имя).ТабличныеЧасти Цикл
		СписокЧастей.Добавить(Часть.Имя, Часть.Представление);
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ВариантыОбъектовНаСервере()

	Возврат AI_ИнтерфейсныеСценарии.ВариантыОбъектовМетаданных();

КонецФункции

&НаСервереБезКонтекста
Функция ЗарегистрированныеОбработкиНаСервере()

	Возврат AI_ИнтерфейсныеСценарии.ЗарегистрированныеОбработки();

КонецФункции

&НаСервере
Процедура ЗаполнитьМетодыОбработчикаНаСервере()

	ЗаполнитьМетодыОбработчика();
	ОбновитьВидимость();

КонецПроцедуры

// Методы подсказываются из самоописания обработки (СведенияОДействияхLLM) по
// назначению: «Действие», «Проверка», «ПодготовкаЗапроса», «ПослеОтвета»,
// «ПослеДействия». Если обработка себя не описывает, остаются стандартные
// имена и ручной ввод.
&НаСервере
Процедура ЗаполнитьМетодыОбработчика()

	ПоляПоНазначению = Новый Соответствие;
	ПоляПоНазначению.Вставить("Проверка", "МетодПроверки");
	ПоляПоНазначению.Вставить("ПодготовкаЗапроса", "МетодПодготовкиЗапроса");
	ПоляПоНазначению.Вставить("ПослеОтвета", "МетодПослеОтвета");
	ПоляПоНазначению.Вставить("ПослеДействия", "МетодПослеДействия");
	Элементы.МетодДействия.СписокВыбора.Очистить();
	Для Каждого Поле Из ПоляПоНазначению Цикл
		Элементы[Поле.Значение].СписокВыбора.Очистить();
	КонецЦикла;
	Если Не ЗначениеЗаполнено(Объект.Обработчик) Тогда
		Возврат;
	КонецЕсли;
	Методы = AI_ПрименениеРекомендаций.ПолучитьМетодыОбработчика(Объект.Обработчик);
	Для Каждого Метод Из Методы Цикл
		Представление = ?(ЗначениеЗаполнено(Метод.Представление),
			СтрШаблон("%1 — %2", Метод.Метод, Метод.Представление), Метод.Метод);
		ИмяПоля = ПоляПоНазначению.Получить(Метод.Назначение);
		Если ИмяПоля = Неопределено Тогда
			ИмяПоля = "МетодДействия";
		КонецЕсли;
		Элементы[ИмяПоля].СписокВыбора.Добавить(Метод.Метод, Представление);
	КонецЦикла;

КонецПроцедуры

// Имя роли или группы доступа — выбором: роль из метаданных, группа или профиль
// доступа из данных БСП (в Документообороте — профили полномочий). Опечатка в
// имени спрятала бы действие от всех.
&НаКлиенте
Процедура ВидимостьИмяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Видимость.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ВидУсловия) Тогда
		ПоказатьПредупреждение(, "Сначала выберите условие: роль или группа доступа.");
		Возврат;
	КонецЕсли;
	Варианты = ВариантыУсловияВидимостиНаСервере(ТекущиеДанные.ВидУсловия);
	Если Варианты.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Выбирать не из чего: в конфигурации нет групп доступа БСП"
			+ " и полномочий Документооборота. Используйте условие по роли.");
		Возврат;
	КонецЕсли;
	Варианты.ПоказатьВыборЭлемента(
		Новый ОписаниеОповещения("ВыборИмениВидимостиЗавершение", ЭтотОбъект,
			Элементы.Видимость.ТекущаяСтрока),
		"Кому показывать",
		Варианты.НайтиПоЗначению(ТекущиеДанные.Имя));

КонецПроцедуры

&НаКлиенте
Процедура ВыборИмениВидимостиЗавершение(ВыбранныйЭлемент, ИдентификаторСтроки) Экспорт

	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Строка = Объект.Видимость.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Строка.Имя = ВыбранныйЭлемент.Значение;
	Модифицированность = Истина;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ВариантыУсловияВидимостиНаСервере(ВидУсловия)

	Возврат AI_ИнтерфейсныеСценарии.ВариантыУсловияВидимости(ВидУсловия);

КонецФункции

&НаСервере
Процедура ОбновитьПроверкуНаСервере()

	ОбновитьПроверку();

КонецПроцедуры

// Проверяется то, что сейчас в форме, а не записанная версия: администратор
// видит последствия правки до записи.
&НаСервере
Процедура ОбновитьПроверку()

	Проверка = AI_ИнтерфейсныеСценарии.ПроблемыНастройкиМеста(РеквизитФормыВЗначение("Объект"));
	Если Проверка.Проблемы.Количество() = 0 Тогда
		Элементы.ТекстПроверки.Заголовок = ?(Объект.Видимость.Количество() = 0,
			"Настройка в порядке: действие увидят пользователи с доступом к агенту сценария.",
			"Настройка в порядке: действие увидят пользователи с доступом к агенту сценария"
				+ " и под одно из условий «Кому показывать».");
		Элементы.ТекстПроверки.ЦветТекста = Новый Цвет(0, 110, 40);
	Иначе
		Строки = Новый Массив;
		Для Каждого Проблема Из Проверка.Проблемы Цикл
			Строки.Добавить("• " + Проблема);
		КонецЦикла;
		Элементы.ТекстПроверки.Заголовок = СтрСоединить(Строки, Символы.ПС);
		Элементы.ТекстПроверки.ЦветТекста = Новый Цвет(170, 40, 30);
	КонецЕсли;
	Элементы.КнопкаПодключитьКоманду.Видимость = Проверка.МожноНазначитьОбработку;
	Элементы.КнопкаОбновитьСхему.Видимость = Проверка.СхемаОтстает;

КонецПроцедуры

&НаСервере
Функция ПодключитьКомандуНаСервере()

	Попытка
		AI_ИнтерфейсныеСценарии.НазначитьОбработкуБСП(СокрЛП(Объект.ПолноеИмяМетаданных));
	Исключение
		Возврат "Не удалось подключить команду: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	ОбновитьПроверку();
	Возврат "";

КонецФункции

&НаСервере
Функция ОбновитьСхемуНаСервере()

	Если Не ЗначениеЗаполнено(Объект.КартаИзвлечения) Или Не ЗначениеЗаполнено(Объект.Сценарий) Тогда
		Возврат "Выберите сценарий и карту извлечения.";
	КонецЕсли;
	Попытка
		AI_ИзвлечениеРеквизитов.ЗаписатьСхемуВСценарий(Объект.КартаИзвлечения, Объект.Сценарий);
	Исключение
		Возврат "Не удалось обновить схему: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	ОбновитьПроверку();
	Возврат "";

КонецФункции

&НаСервере
Функция ДобавитьВыборФайлаНаСервере()

	Если Объект.ТипМеста = "Глобально" Или Не ЗначениеЗаполнено(Объект.ПолноеИмяМетаданных) Тогда
		Возврат "Сначала выберите объект: файлы берутся из прикрепленных к нему.";
	КонецЕсли;
	Шаблон = AI_ИзвлечениеРеквизитов.ШаблонУточненияФайлов(Объект.ПолноеИмяМетаданных);
	Если Шаблон = Неопределено Тогда
		Возврат "Не удалось распознать, как конфигурация хранит файлы этого объекта."
			+ " Заполните источник вручную или реализуйте"
			+ " AI_ВложенияПереопределяемый.ПриПолученииСодержимогоВложения.";
	КонецЕсли;

	НоваяСтрока = Объект.Уточнения.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Шаблон);
	Элементы.Уточнения.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаУточнения;
	// Активизация строки с сервера не вызывает клиентский обработчик — панель
	// заполняем сразу.
	Для Каждого ИмяКолонки Из КолонкиПанелиВопроса() Цикл
		ЭтотОбъект["Вопрос" + ИмяКолонки] = НоваяСтрока[ИмяКолонки];
	КонецЦикла;
	Модифицированность = Истина;
	ОбновитьПроверку();
	Возврат "";

КонецФункции

#КонецОбласти
